Nocterra-Consulting/MegaCore/avr/boards.txt
2561.menu.clock.14_7456MHz_external=External 14.7456 MHz
2561.menu.clock.14_7456MHz_external.upload.speed=115200
2561.menu.clock.14_7456MHz_external.bootloader.low_fuses=0xf7
2561.menu.clock.14_7456MHz_external.build.clkpr=
2561.menu.clock.14_7456MHz_external.build.clock_speed={build.f_cpu}
2561.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

2561.menu.clock.12MHz_external=External 12 MHz
2561.menu.clock.12MHz_external.upload.speed=57600
2561.menu.clock.12MHz_external.bootloader.low_fuses=0xf7
2561.menu.clock.12MHz_external.build.clkpr=
2561.menu.clock.12MHz_external.build.clock_speed={build.f_cpu}
2561.menu.clock.12MHz_external.build.f_cpu=12000000L

2561.menu.clock.11_0592MHz_external=External 11.0592 MHz
2561.menu.clock.11_0592MHz_external.upload.speed=115200
2561.menu.clock.11_0592MHz_external.bootloader.low_fuses=0xf7
2561.menu.clock.11_0592MHz_external.build.clkpr=
2561.menu.clock.11_0592MHz_external.build.clock_speed={build.f_cpu}
2561.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

2561.menu.clock.8MHz_external=External 8 MHz
2561.menu.clock.8MHz_external.upload.speed=57600
2561.menu.clock.8MHz_external.bootloader.low_fuses=0xf7
2561.menu.clock.8MHz_external.build.clkpr=
2561.menu.clock.8MHz_external.build.clock_speed={build.f_cpu}
2561.menu.clock.8MHz_external.build.f_cpu=8000000L

2561.menu.clock.7_3728MHz_external=External 7.3728 MHz
2561.menu.clock.7_3728MHz_external.upload.speed=115200
2561.menu.clock.7_3728MHz_external.bootloader.low_fuses=0xf7
2561.menu.clock.7_3728MHz_external.build.clkpr=
2561.menu.clock.7_3728MHz_external.build.clock_speed={build.f_cpu}
2561.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

2561.menu.clock.4MHz_external=External 4 MHz
2561.menu.clock.4MHz_external.upload.speed=9600
2561.menu.clock.4MHz_external.bootloader.low_fuses=0xf7
2561.menu.clock.4MHz_external.build.clkpr=
2561.menu.clock.4MHz_external.build.clock_speed={build.f_cpu}
2561.menu.clock.4MHz_external.build.f_cpu=4000000L

2561.menu.clock.3_6864MHz_external=External 3.6864 MHz
2561.menu.clock.3_6864MHz_external.upload.speed=115200
2561.menu.clock.3_6864MHz_external.bootloader.low_fuses=0xf7
2561.menu.clock.3_6864MHz_external.build.clkpr=
2561.menu.clock.3_6864MHz_external.build.clock_speed={build.f_cpu}
2561.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

2561.menu.clock.2MHz_external=External 2 MHz
2561.menu.clock.2MHz_external.upload.speed=9600
2561.menu.clock.2MHz_external.bootloader.low_fuses=0xf7
2561.menu.clock.2MHz_external.build.clkpr=
2561.menu.clock.2MHz_external.build.clock_speed={build.f_cpu}
2561.menu.clock.2MHz_external.build.f_cpu=2000000L

2561.menu.clock.1_8432MHz_external=External 1.8432 MHz
2561.menu.clock.1_8432MHz_external.upload.speed=115200
2561.menu.clock.1_8432MHz_external.bootloader.low_fuses=0xf7
2561.menu.clock.1_8432MHz_external.build.clkpr=
2561.menu.clock.1_8432MHz_external.build.clock_speed={build.f_cpu}
2561.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

2561.menu.clock.1MHz_external=External 1 MHz
2561.menu.clock.1MHz_external.upload.speed=9600
2561.menu.clock.1MHz_external.bootloader.low_fuses=0xf7
2561.menu.clock.1MHz_external.build.clkpr=
2561.menu.clock.1MHz_external.build.clock_speed={build.f_cpu}
2561.menu.clock.1MHz_external.build.f_cpu=1000000L

2561.menu.clock.8MHz_internal=Internal 8 MHz
2561.menu.clock.8MHz_internal.upload.speed=38400
2561.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
2561.menu.clock.8MHz_internal.build.clkpr=
2561.menu.clock.8MHz_internal.build.clock_speed={build.f_cpu}
2561.menu.clock.8MHz_internal.build.f_cpu=8000000L

2561.menu.clock.4MHz_internal=Internal 4 MHz
2561.menu.clock.4MHz_internal.upload.speed=9600
2561.menu.clock.4MHz_internal.bootloader.low_fuses=0xe2
2561.menu.clock.4MHz_internal.build.clkpr=-DOSC_PRESCALER=0x01
2561.menu.clock.4MHz_internal.build.clock_speed=8000000L
2561.menu.clock.4MHz_internal.build.f_cpu=4000000L

2561.menu.clock.2MHz_internal=Internal 2 MHz
2561.menu.clock.2MHz_internal.upload.speed=9600
2561.menu.clock.2MHz_internal.bootloader.low_fuses=0xe2
2561.menu.clock.2MHz_internal.build.clkpr=-DOSC_PRESCALER=0x02
2561.menu.clock.2MHz_internal.build.clock_speed=8000000L
2561.menu.clock.2MHz_internal.build.f_cpu=2000000L

2561.menu.clock.1MHz_internal=Internal 1 MHz
2561.menu.clock.1MHz_internal.upload.speed=9600
2561.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
2561.menu.clock.1MHz_internal.build.clkpr=
2561.menu.clock.1MHz_internal.build.clock_speed={build.f_cpu}
2561.menu.clock.1MHz_internal.build.f_cpu=1000000L



#####################
#### ATmega2560  ####
#####################

# General
2560.name=ATmega2560
2560.upload.tool=avrdude
2560.upload.maximum_data_size=8192
2560.bootloader.tool=avrdude
2560.bootloader.unlock_bits=0x3f
2560.bootloader.lock_bits=0x0f
2560.build.core=MCUdude_corefiles
2560.build.board=AVR_ATmega2560
2560.build.mcu=atmega2560
2560.build.bootloader_led=B7
2560.build.extra_flags={build.clkpr}

# Upload port select
2560.menu.bootloader.uart0=Yes (UART0)
2560.menu.bootloader.uart0.upload.maximum_size=261120
2560.menu.bootloader.uart0.upload.protocol=arduino
2560.menu.bootloader.uart0.upload.port=UART0
2560.menu.bootloader.uart0.build.export_merged_output=true
2560.menu.bootloader.uart0.bootloader.high_fuses=0b1101{bootloader.eesave_bit}110
2560.menu.bootloader.uart0.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.clock_speed}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.clock_speed}_{build.bootloader_led}_BIGBOOT.hex

2560.menu.bootloader.uart1=Yes (UART1)
2560.menu.bootloader.uart1.upload.maximum_size=261120
2560.menu.bootloader.uart1.upload.protocol=arduino
2560.menu.bootloader.uart1.upload.port=UART1
2560.menu.bootloader.uart1.build.export_merged_output=true
2560.menu.bootloader.uart1.bootloader.high_fuses=0b1101{bootloader.eesave_bit}110
2560.menu.bootloader.uart1.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.clock_speed}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.clock_speed}_{build.bootloader_led}_BIGBOOT.hex

2560.menu.bootloader.uart2=Yes (UART2)
2560.menu.bootloader.uart2.upload.maximum_size=261120
2560.menu.bootloader.uart2.upload.protocol=arduino
2560.menu.bootloader.uart2.upload.port=UART2
2560.menu.bootloader.uart2.build.export_merged_output=true
2560.menu.bootloader.uart2.bootloader.high_fuses=0b1101{bootloader.eesave_bit}110
2560.menu.bootloader.uart2.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.clock_speed}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.clock_speed}_{build.bootloader_led}_BIGBOOT.hex

2560.menu.bootloader.uart3=Yes (UART3)
2560.menu.bootloader.uart3.upload.maximum_size=261120
2560.menu.bootloader.uart3.upload.protocol=arduino
2560.menu.bootloader.uart3.upload.port=UART3
2560.menu.bootloader.uart3.build.export_merged_output=true
2560.menu.bootloader.uart3.bootloader.high_fuses=0b1101{bootloader.eesave_bit}110
2560.menu.bootloader.uart3.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.clock_speed}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.clock_speed}_{build.bootloader_led}_BIGBOOT.hex

2560.menu.bootloader.no_bootloader=No bootloader
2560.menu.bootloader.no_bootloader.upload.maximum_size=262144
2560.menu.bootloader.no_bootloader.build.export_merged_output=false
2560.menu.bootloader.no_bootloader.bootloader.high_fuses=0b1101{bootloader.eesave_bit}111
2560.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# EEPROM
2560.menu.eeprom.keep=EEPROM retained
2560.menu.eeprom.keep.bootloader.eesave_bit=0
2560.menu.eeprom.erase=EEPROM not retained
2560.menu.eeprom.erase.bootloader.eesave_bit=1

# Pinouts
2560.menu.pinout.mega_pinout=Arduino MEGA pinout
2560.menu.pinout.mega_pinout.build.variant=100-pin-arduino-mega
2560.menu.pinout.avr_pinout=AVR pinout
2560.menu.pinout.avr_pinout.build.variant=100-pin-avr

# Brown out detection
2560.menu.BOD.2v7=BOD 2.7V
2560.menu.BOD.2v7.bootloader.extended_fuses=0xfd
2560.menu.BOD.4v3=BOD 4.3V
2560.menu.BOD.4v3.bootloader.extended_fuses=0xfc
2560.menu.BOD.1v8=BOD 1.8V
2560.menu.BOD.1v8.bootloader.extended_fuses=0xfe
2560.menu.BOD.disabled=BOD disabled
2560.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
2560.menu.LTO.Os=LTO disabled
2560.menu.LTO.Os.compiler.c.extra_flags=
2560.menu.LTO.Os.compiler.c.elf.extra_flags=
2560.menu.LTO.Os.compiler.cpp.extra_flags=
2560.menu.LTO.Os.ltoarcmd=avr-ar

2560.menu.LTO.Os_flto=LTO enabled
2560.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
2560.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
2560.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
2560.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

