Nocterra-Consulting/MegaCore/avr/boards.txt
1280.menu.LTO.Os_flto=LTO enabled
1280.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
1280.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
1280.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
1280.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies
1280.menu.clock.16MHz_external=External 16 MHz
1280.menu.clock.16MHz_external.upload.speed=115200
1280.menu.clock.16MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.16MHz_external.build.clkpr=
1280.menu.clock.16MHz_external.build.clock_speed={build.f_cpu}
1280.menu.clock.16MHz_external.build.f_cpu=16000000L

1280.menu.clock.20MHz_external=External 20 MHz
1280.menu.clock.20MHz_external.upload.speed=115200
1280.menu.clock.20MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.20MHz_external.build.clkpr=
1280.menu.clock.20MHz_external.build.clock_speed={build.f_cpu}
1280.menu.clock.20MHz_external.build.f_cpu=20000000L

1280.menu.clock.18_432MHz_external=External 18.4320 MHz
1280.menu.clock.18_432MHz_external.upload.speed=115200
1280.menu.clock.18_432MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.18_432MHz_external.build.clkpr=
1280.menu.clock.18_432MHz_external.build.clock_speed={build.f_cpu}
1280.menu.clock.18_432MHz_external.build.f_cpu=18432000L

1280.menu.clock.14_7456MHz_external=External 14.7456 MHz
1280.menu.clock.14_7456MHz_external.upload.speed=115200
1280.menu.clock.14_7456MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.14_7456MHz_external.build.clkpr=
1280.menu.clock.14_7456MHz_external.build.clock_speed={build.f_cpu}
1280.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

1280.menu.clock.12MHz_external=External 12 MHz
1280.menu.clock.12MHz_external.upload.speed=57600
1280.menu.clock.12MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.12MHz_external.build.clkpr=
1280.menu.clock.12MHz_external.build.clock_speed={build.f_cpu}
1280.menu.clock.12MHz_external.build.f_cpu=12000000L

1280.menu.clock.11_0592MHz_external=External 11.0592 MHz
1280.menu.clock.11_0592MHz_external.upload.speed=115200
1280.menu.clock.11_0592MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.11_0592MHz_external.build.clkpr=
1280.menu.clock.11_0592MHz_external.build.clock_speed={build.f_cpu}
1280.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

1280.menu.clock.8MHz_external=External 8 MHz
1280.menu.clock.8MHz_external.upload.speed=57600
1280.menu.clock.8MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.8MHz_external.build.clkpr=
1280.menu.clock.8MHz_external.build.clock_speed={build.f_cpu}
1280.menu.clock.8MHz_external.build.f_cpu=8000000L

1280.menu.clock.7_3728MHz_external=External 7.3728 MHz
1280.menu.clock.7_3728MHz_external.upload.speed=115200
1280.menu.clock.7_3728MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.7_3728MHz_external.build.clkpr=
1280.menu.clock.7_3728MHz_external.build.clock_speed={build.f_cpu}
1280.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

1280.menu.clock.4MHz_external=External 4 MHz
1280.menu.clock.4MHz_external.upload.speed=9600
1280.menu.clock.4MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.4MHz_external.build.clkpr=
1280.menu.clock.4MHz_external.build.clock_speed={build.f_cpu}
1280.menu.clock.4MHz_external.build.f_cpu=4000000L

1280.menu.clock.3_6864MHz_external=External 3.6864 MHz
1280.menu.clock.3_6864MHz_external.upload.speed=115200
1280.menu.clock.3_6864MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.3_6864MHz_external.build.clkpr=
1280.menu.clock.3_6864MHz_external.build.clock_speed={build.f_cpu}
1280.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

1280.menu.clock.2MHz_external=External 2 MHz
1280.menu.clock.2MHz_external.upload.speed=9600
1280.menu.clock.2MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.2MHz_external.build.clkpr=
1280.menu.clock.2MHz_external.build.clock_speed={build.f_cpu}
1280.menu.clock.2MHz_external.build.f_cpu=2000000L

1280.menu.clock.1_8432MHz_external=External 1.8432 MHz
1280.menu.clock.1_8432MHz_external.upload.speed=115200
1280.menu.clock.1_8432MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.1_8432MHz_external.build.clkpr=
1280.menu.clock.1_8432MHz_external.build.clock_speed={build.f_cpu}
1280.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

1280.menu.clock.1MHz_external=External 1 MHz
1280.menu.clock.1MHz_external.upload.speed=9600
1280.menu.clock.1MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.1MHz_external.build.clkpr=
1280.menu.clock.1MHz_external.build.clock_speed={build.f_cpu}
1280.menu.clock.1MHz_external.build.f_cpu=1000000L

1280.menu.clock.8MHz_internal=Internal 8 MHz
1280.menu.clock.8MHz_internal.upload.speed=38400
1280.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
1280.menu.clock.8MHz_internal.build.clkpr=
1280.menu.clock.8MHz_internal.build.clock_speed={build.f_cpu}
1280.menu.clock.8MHz_internal.build.f_cpu=8000000L

1280.menu.clock.4MHz_internal=Internal 4 MHz
1280.menu.clock.4MHz_internal.upload.speed=9600
1280.menu.clock.4MHz_internal.bootloader.low_fuses=0xe2
1280.menu.clock.4MHz_internal.build.clkpr=-DOSC_PRESCALER=0x01
1280.menu.clock.4MHz_internal.build.clock_speed=8000000L
1280.menu.clock.4MHz_internal.build.f_cpu=4000000L

1280.menu.clock.2MHz_internal=Internal 2 MHz
1280.menu.clock.2MHz_internal.upload.speed=9600
1280.menu.clock.2MHz_internal.bootloader.low_fuses=0xe2
1280.menu.clock.2MHz_internal.build.clkpr=-DOSC_PRESCALER=0x02
1280.menu.clock.2MHz_internal.build.clock_speed=8000000L
1280.menu.clock.2MHz_internal.build.f_cpu=2000000L

1280.menu.clock.1MHz_internal=Internal 1 MHz
1280.menu.clock.1MHz_internal.upload.speed=9600
1280.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
1280.menu.clock.1MHz_internal.build.clkpr=
1280.menu.clock.1MHz_internal.build.clock_speed={build.f_cpu}
1280.menu.clock.1MHz_internal.build.f_cpu=1000000L



#####################
####  ATmega649  ####
#####################

# General
649.name=ATmega649
649.upload.tool=avrdude
649.upload.maximum_data_size=4096
649.bootloader.tool=avrdude
649.bootloader.unlock_bits=0x3f
649.bootloader.lock_bits=0x0f
649.build.core=MCUdude_corefiles
649.build.variant=64-pin-avr
649.build.board=AVR_ATmega649
649.build.bootloader_led=B5
649.build.extra_flags={build.clkpr}

# Upload port select
649.menu.bootloader.uart0=Yes (UART0)
649.menu.bootloader.uart0.upload.maximum_size=64512
649.menu.bootloader.uart0.upload.protocol=arduino
649.menu.bootloader.uart0.upload.port=UART0
649.menu.bootloader.uart0.build.export_merged_output=true
649.menu.bootloader.uart0.bootloader.high_fuses=0b1101{bootloader.eesave_bit}110
649.menu.bootloader.uart0.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.clock_speed}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.clock_speed}_{build.bootloader_led}_BIGBOOT.hex

649.menu.bootloader.no_bootloader=No bootloader
649.menu.bootloader.no_bootloader.upload.maximum_size=65536
649.menu.bootloader.no_bootloader.build.export_merged_output=false
649.menu.bootloader.no_bootloader.bootloader.high_fuses=0b1101{bootloader.eesave_bit}111
649.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# EEPROM
649.menu.eeprom.keep=EEPROM retained
649.menu.eeprom.keep.bootloader.eesave_bit=0
649.menu.eeprom.erase=EEPROM not retained
649.menu.eeprom.erase.bootloader.eesave_bit=1

