Nocterra-Consulting/MegaCore/avr/boards.txt
# Variants
649.menu.variant.modelP=649P
649.menu.variant.modelP.build.mcu=atmega649p
649.menu.variant.modelA=649/A
649.menu.variant.modelA.build.mcu=atmega649

# Brown out detection
649.menu.BOD.2v7=BOD 2.7V
649.menu.BOD.2v7.bootloader.extended_fuses=0xfb
649.menu.BOD.4v3=BOD 4.3V
649.menu.BOD.4v3.bootloader.extended_fuses=0xf9
649.menu.BOD.1v8=BOD 1.8V
649.menu.BOD.1v8.bootloader.extended_fuses=0xfd
649.menu.BOD.disabled=BOD disabled
649.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
649.menu.LTO.Os=LTO disabled
649.menu.LTO.Os.compiler.c.extra_flags=
649.menu.LTO.Os.compiler.c.elf.extra_flags=
649.menu.LTO.Os.compiler.cpp.extra_flags=
649.menu.LTO.Os.ltoarcmd=avr-ar

649.menu.LTO.Os_flto=LTO enabled
649.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
649.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
649.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
649.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies
649.menu.clock.16MHz_external=External 16 MHz
649.menu.clock.16MHz_external.upload.speed=115200
649.menu.clock.16MHz_external.bootloader.low_fuses=0xff
649.menu.clock.16MHz_external.build.clkpr=
649.menu.clock.16MHz_external.build.clock_speed={build.f_cpu}
649.menu.clock.16MHz_external.build.f_cpu=16000000L

649.menu.clock.20MHz_external=External 20 MHz
649.menu.clock.20MHz_external.upload.speed=115200
649.menu.clock.20MHz_external.bootloader.low_fuses=0xff
649.menu.clock.20MHz_external.build.clkpr=
649.menu.clock.20MHz_external.build.clock_speed={build.f_cpu}
649.menu.clock.20MHz_external.build.f_cpu=20000000L

649.menu.clock.18_432MHz_external=External 18.4320 MHz
649.menu.clock.18_432MHz_external.upload.speed=115200
649.menu.clock.18_432MHz_external.bootloader.low_fuses=0xff
649.menu.clock.18_432MHz_external.build.clkpr=
649.menu.clock.18_432MHz_external.build.clock_speed={build.f_cpu}
649.menu.clock.18_432MHz_external.build.f_cpu=18432000L

649.menu.clock.14_7456MHz_external=External 14.7456 MHz
649.menu.clock.14_7456MHz_external.upload.speed=115200
649.menu.clock.14_7456MHz_external.bootloader.low_fuses=0xff
649.menu.clock.14_7456MHz_external.build.clkpr=
649.menu.clock.14_7456MHz_external.build.clock_speed={build.f_cpu}
649.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

649.menu.clock.12MHz_external=External 12 MHz
649.menu.clock.12MHz_external.upload.speed=57600
649.menu.clock.12MHz_external.bootloader.low_fuses=0xff
649.menu.clock.12MHz_external.build.clkpr=
649.menu.clock.12MHz_external.build.clock_speed={build.f_cpu}
649.menu.clock.12MHz_external.build.f_cpu=12000000L

649.menu.clock.11_0592MHz_external=External 11.0592 MHz
649.menu.clock.11_0592MHz_external.upload.speed=115200
649.menu.clock.11_0592MHz_external.bootloader.low_fuses=0xff
649.menu.clock.11_0592MHz_external.build.clkpr=
649.menu.clock.11_0592MHz_external.build.clock_speed={build.f_cpu}
649.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

649.menu.clock.8MHz_external=External 8 MHz
649.menu.clock.8MHz_external.upload.speed=57600
649.menu.clock.8MHz_external.bootloader.low_fuses=0xff
649.menu.clock.8MHz_external.build.clkpr=
649.menu.clock.8MHz_external.build.clock_speed={build.f_cpu}
649.menu.clock.8MHz_external.build.f_cpu=8000000L

649.menu.clock.7_3728MHz_external=External 7.3728 MHz
649.menu.clock.7_3728MHz_external.upload.speed=115200
649.menu.clock.7_3728MHz_external.bootloader.low_fuses=0xff
649.menu.clock.7_3728MHz_external.build.clkpr=
649.menu.clock.7_3728MHz_external.build.clock_speed={build.f_cpu}
649.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

649.menu.clock.4MHz_external=External 4 MHz
649.menu.clock.4MHz_external.upload.speed=9600
649.menu.clock.4MHz_external.bootloader.low_fuses=0xff
649.menu.clock.4MHz_external.build.clkpr=
649.menu.clock.4MHz_external.build.clock_speed={build.f_cpu}
649.menu.clock.4MHz_external.build.f_cpu=4000000L

649.menu.clock.3_6864MHz_external=External 3.6864 MHz
649.menu.clock.3_6864MHz_external.upload.speed=115200
649.menu.clock.3_6864MHz_external.bootloader.low_fuses=0xff
649.menu.clock.3_6864MHz_external.build.clkpr=
649.menu.clock.3_6864MHz_external.build.clock_speed={build.f_cpu}
649.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

649.menu.clock.2MHz_external=External 2 MHz
649.menu.clock.2MHz_external.upload.speed=9600
649.menu.clock.2MHz_external.bootloader.low_fuses=0xff
649.menu.clock.2MHz_external.build.clkpr=
649.menu.clock.2MHz_external.build.clock_speed={build.f_cpu}
649.menu.clock.2MHz_external.build.f_cpu=2000000L

649.menu.clock.1_8432MHz_external=External 1.8432 MHz
649.menu.clock.1_8432MHz_external.upload.speed=115200
649.menu.clock.1_8432MHz_external.bootloader.low_fuses=0xff
649.menu.clock.1_8432MHz_external.build.clkpr=
649.menu.clock.1_8432MHz_external.build.clock_speed={build.f_cpu}
649.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

649.menu.clock.1MHz_external=External 1 MHz
649.menu.clock.1MHz_external.upload.speed=9600
649.menu.clock.1MHz_external.bootloader.low_fuses=0xff
649.menu.clock.1MHz_external.build.clkpr=
649.menu.clock.1MHz_external.build.clock_speed={build.f_cpu}
649.menu.clock.1MHz_external.build.f_cpu=1000000L

649.menu.clock.8MHz_internal=Internal 8 MHz
649.menu.clock.8MHz_internal.upload.speed=38400
649.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
649.menu.clock.8MHz_internal.build.clkpr=
649.menu.clock.8MHz_internal.build.clock_speed={build.f_cpu}
649.menu.clock.8MHz_internal.build.f_cpu=8000000L

649.menu.clock.4MHz_internal=Internal 4 MHz
649.menu.clock.4MHz_internal.upload.speed=9600
649.menu.clock.4MHz_internal.bootloader.low_fuses=0xe2
649.menu.clock.4MHz_internal.build.clkpr=-DOSC_PRESCALER=0x01
649.menu.clock.4MHz_internal.build.clock_speed=8000000L
649.menu.clock.4MHz_internal.build.f_cpu=4000000L

649.menu.clock.2MHz_internal=Internal 2 MHz
649.menu.clock.2MHz_internal.upload.speed=9600
649.menu.clock.2MHz_internal.bootloader.low_fuses=0xe2
649.menu.clock.2MHz_internal.build.clkpr=-DOSC_PRESCALER=0x02
649.menu.clock.2MHz_internal.build.clock_speed=8000000L
649.menu.clock.2MHz_internal.build.f_cpu=2000000L

649.menu.clock.1MHz_internal=Internal 1 MHz
649.menu.clock.1MHz_internal.upload.speed=9600
649.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
649.menu.clock.1MHz_internal.build.clkpr=
649.menu.clock.1MHz_internal.build.clock_speed={build.f_cpu}
649.menu.clock.1MHz_internal.build.f_cpu=1000000L



#####################
####  ATmega645  ####
#####################

# General
645.name=ATmega645
645.upload.tool=avrdude
645.upload.maximum_data_size=4096
645.bootloader.tool=avrdude
645.bootloader.unlock_bits=0x3f
645.bootloader.lock_bits=0x0f
645.build.core=MCUdude_corefiles
645.build.variant=64-pin-avr
645.build.board=AVR_ATmega645
645.build.bootloader_led=B5
645.build.extra_flags={build.clkpr}

# Upload port select
645.menu.bootloader.uart0=Yes (UART0)
645.menu.bootloader.uart0.upload.maximum_size=64512
645.menu.bootloader.uart0.upload.protocol=arduino
645.menu.bootloader.uart0.upload.port=UART0
645.menu.bootloader.uart0.build.export_merged_output=true
645.menu.bootloader.uart0.bootloader.high_fuses=0b1101{bootloader.eesave_bit}110
645.menu.bootloader.uart0.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.clock_speed}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.clock_speed}_{build.bootloader_led}_BIGBOOT.hex

645.menu.bootloader.no_bootloader=No bootloader
645.menu.bootloader.no_bootloader.upload.maximum_size=65536
645.menu.bootloader.no_bootloader.build.export_merged_output=false
645.menu.bootloader.no_bootloader.bootloader.high_fuses=0b1101{bootloader.eesave_bit}111
645.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# EEPROM
645.menu.eeprom.keep=EEPROM retained
645.menu.eeprom.keep.bootloader.eesave_bit=0
645.menu.eeprom.erase=EEPROM not retained
645.menu.eeprom.erase.bootloader.eesave_bit=1

