Nocterra-Consulting/MegaCore/avr/boards.txt
# Clock frequencies
640.menu.clock.16MHz_external=External 16 MHz
640.menu.clock.16MHz_external.upload.speed=115200
640.menu.clock.16MHz_external.bootloader.low_fuses=0xf7
640.menu.clock.16MHz_external.build.clkpr=
640.menu.clock.16MHz_external.build.clock_speed={build.f_cpu}
640.menu.clock.16MHz_external.build.f_cpu=16000000L

640.menu.clock.20MHz_external=External 20 MHz
640.menu.clock.20MHz_external.upload.speed=115200
640.menu.clock.20MHz_external.bootloader.low_fuses=0xf7
640.menu.clock.20MHz_external.build.clkpr=
640.menu.clock.20MHz_external.build.clock_speed={build.f_cpu}
640.menu.clock.20MHz_external.build.f_cpu=20000000L

640.menu.clock.18_432MHz_external=External 18.4320 MHz
640.menu.clock.18_432MHz_external.upload.speed=115200
640.menu.clock.18_432MHz_external.bootloader.low_fuses=0xf7
640.menu.clock.18_432MHz_external.build.clkpr=
640.menu.clock.18_432MHz_external.build.clock_speed={build.f_cpu}
640.menu.clock.18_432MHz_external.build.f_cpu=18432000L

640.menu.clock.14_7456MHz_external=External 14.7456 MHz
640.menu.clock.14_7456MHz_external.upload.speed=115200
640.menu.clock.14_7456MHz_external.bootloader.low_fuses=0xf7
640.menu.clock.14_7456MHz_external.build.clkpr=
640.menu.clock.14_7456MHz_external.build.clock_speed={build.f_cpu}
640.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

640.menu.clock.12MHz_external=External 12 MHz
640.menu.clock.12MHz_external.upload.speed=57600
640.menu.clock.12MHz_external.bootloader.low_fuses=0xf7
640.menu.clock.12MHz_external.build.clkpr=
640.menu.clock.12MHz_external.build.clock_speed={build.f_cpu}
640.menu.clock.12MHz_external.build.f_cpu=12000000L

640.menu.clock.11_0592MHz_external=External 11.0592 MHz
640.menu.clock.11_0592MHz_external.upload.speed=115200
640.menu.clock.11_0592MHz_external.bootloader.low_fuses=0xf7
640.menu.clock.11_0592MHz_external.build.clkpr=
640.menu.clock.11_0592MHz_external.build.clock_speed={build.f_cpu}
640.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

640.menu.clock.8MHz_external=External 8 MHz
640.menu.clock.8MHz_external.upload.speed=57600
640.menu.clock.8MHz_external.bootloader.low_fuses=0xf7
640.menu.clock.8MHz_external.build.clkpr=
640.menu.clock.8MHz_external.build.clock_speed={build.f_cpu}
640.menu.clock.8MHz_external.build.f_cpu=8000000L

640.menu.clock.7_3728MHz_external=External 7.3728 MHz
640.menu.clock.7_3728MHz_external.upload.speed=115200
640.menu.clock.7_3728MHz_external.bootloader.low_fuses=0xf7
640.menu.clock.7_3728MHz_external.build.clkpr=
640.menu.clock.7_3728MHz_external.build.clock_speed={build.f_cpu}
640.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

640.menu.clock.4MHz_external=External 4 MHz
640.menu.clock.4MHz_external.upload.speed=9600
640.menu.clock.4MHz_external.bootloader.low_fuses=0xf7
640.menu.clock.4MHz_external.build.clkpr=
640.menu.clock.4MHz_external.build.clock_speed={build.f_cpu}
640.menu.clock.4MHz_external.build.f_cpu=4000000L

640.menu.clock.3_6864MHz_external=External 3.6864 MHz
640.menu.clock.3_6864MHz_external.upload.speed=115200
640.menu.clock.3_6864MHz_external.bootloader.low_fuses=0xf7
640.menu.clock.3_6864MHz_external.build.clkpr=
640.menu.clock.3_6864MHz_external.build.clock_speed={build.f_cpu}
640.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

640.menu.clock.2MHz_external=External 2 MHz
640.menu.clock.2MHz_external.upload.speed=9600
640.menu.clock.2MHz_external.bootloader.low_fuses=0xf7
640.menu.clock.2MHz_external.build.clkpr=
640.menu.clock.2MHz_external.build.clock_speed={build.f_cpu}
640.menu.clock.2MHz_external.build.f_cpu=2000000L

640.menu.clock.1_8432MHz_external=External 1.8432 MHz
640.menu.clock.1_8432MHz_external.upload.speed=115200
640.menu.clock.1_8432MHz_external.bootloader.low_fuses=0xf7
640.menu.clock.1_8432MHz_external.build.clkpr=
640.menu.clock.1_8432MHz_external.build.clock_speed={build.f_cpu}
640.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

640.menu.clock.1MHz_external=External 1 MHz
640.menu.clock.1MHz_external.upload.speed=9600
640.menu.clock.1MHz_external.bootloader.low_fuses=0xf7
640.menu.clock.1MHz_external.build.clkpr=
640.menu.clock.1MHz_external.build.clock_speed={build.f_cpu}
640.menu.clock.1MHz_external.build.f_cpu=1000000L

640.menu.clock.8MHz_internal=Internal 8 MHz
640.menu.clock.8MHz_internal.upload.speed=38400
640.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
640.menu.clock.8MHz_internal.build.clkpr=
640.menu.clock.8MHz_internal.build.clock_speed={build.f_cpu}
640.menu.clock.8MHz_internal.build.f_cpu=8000000L

640.menu.clock.4MHz_internal=Internal 4 MHz
640.menu.clock.4MHz_internal.upload.speed=9600
640.menu.clock.4MHz_internal.bootloader.low_fuses=0xe2
640.menu.clock.4MHz_internal.build.clkpr=-DOSC_PRESCALER=0x01
640.menu.clock.4MHz_internal.build.clock_speed=8000000L
640.menu.clock.4MHz_internal.build.f_cpu=4000000L

640.menu.clock.2MHz_internal=Internal 2 MHz
640.menu.clock.2MHz_internal.upload.speed=9600
640.menu.clock.2MHz_internal.bootloader.low_fuses=0xe2
640.menu.clock.2MHz_internal.build.clkpr=-DOSC_PRESCALER=0x02
640.menu.clock.2MHz_internal.build.clock_speed=8000000L
640.menu.clock.2MHz_internal.build.f_cpu=2000000L

640.menu.clock.1MHz_internal=Internal 1 MHz
640.menu.clock.1MHz_internal.upload.speed=9600
640.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
640.menu.clock.1MHz_internal.build.clkpr=
640.menu.clock.1MHz_internal.build.clock_speed={build.f_cpu}
640.menu.clock.1MHz_internal.build.f_cpu=1000000L



#####################
####  ATmega329  ####
#####################

# General
329.name=ATmega329
329.upload.tool=avrdude
329.upload.maximum_data_size=2048
329.bootloader.tool=avrdude
329.bootloader.unlock_bits=0x3f
329.bootloader.lock_bits=0x0f
329.build.core=MCUdude_corefiles
329.build.variant=64-pin-avr
329.build.board=AVR_ATmega329
329.build.bootloader_led=B5
329.build.extra_flags={build.clkpr}

# Upload port select
329.menu.bootloader.uart0=Yes (UART0)
329.menu.bootloader.uart0.upload.maximum_size=32256
329.menu.bootloader.uart0.upload.protocol=arduino
329.menu.bootloader.uart0.upload.port=UART0
329.menu.bootloader.uart0.build.export_merged_output=true
329.menu.bootloader.uart0.bootloader.high_fuses=0b1101{bootloader.eesave_bit}110
329.menu.bootloader.uart0.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.clock_speed}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.clock_speed}_{build.bootloader_led}.hex

329.menu.bootloader.no_bootloader=No bootloader
329.menu.bootloader.no_bootloader.upload.maximum_size=32768
329.menu.bootloader.no_bootloader.build.export_merged_output=false
329.menu.bootloader.no_bootloader.bootloader.high_fuses=0b1101{bootloader.eesave_bit}111
329.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# EEPROM
329.menu.eeprom.keep=EEPROM retained
329.menu.eeprom.keep.bootloader.eesave_bit=0
329.menu.eeprom.erase=EEPROM not retained
329.menu.eeprom.erase.bootloader.eesave_bit=1

