Nocterra-Consulting/MegaCore/avr/boards.txt
# Variants
329.menu.variant.modelP=329P/PA
329.menu.variant.modelP.build.mcu=atmega329p
329.menu.variant.modelA=329/A
329.menu.variant.modelA.build.mcu=atmega329

# Brown out detection
329.menu.BOD.2v7=BOD 2.7V
329.menu.BOD.2v7.bootloader.extended_fuses=0xfb
329.menu.BOD.4v3=BOD 4.3V
329.menu.BOD.4v3.bootloader.extended_fuses=0xf9
329.menu.BOD.1v8=BOD 1.8V
329.menu.BOD.1v8.bootloader.extended_fuses=0xfd
329.menu.BOD.disabled=BOD disabled
329.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
329.menu.LTO.Os=LTO disabled
329.menu.LTO.Os.compiler.c.extra_flags=
329.menu.LTO.Os.compiler.c.elf.extra_flags=
329.menu.LTO.Os.compiler.cpp.extra_flags=
329.menu.LTO.Os.ltoarcmd=avr-ar

329.menu.LTO.Os_flto=LTO enabled
329.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
329.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
329.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
329.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies
329.menu.clock.16MHz_external=External 16 MHz
329.menu.clock.16MHz_external.upload.speed=115200
329.menu.clock.16MHz_external.bootloader.low_fuses=0xff
329.menu.clock.16MHz_external.build.clkpr=
329.menu.clock.16MHz_external.build.clock_speed={build.f_cpu}
329.menu.clock.16MHz_external.build.f_cpu=16000000L

329.menu.clock.20MHz_external=External 20 MHz
329.menu.clock.20MHz_external.upload.speed=115200
329.menu.clock.20MHz_external.bootloader.low_fuses=0xff
329.menu.clock.20MHz_external.build.clkpr=
329.menu.clock.20MHz_external.build.clock_speed={build.f_cpu}
329.menu.clock.20MHz_external.build.f_cpu=20000000L

329.menu.clock.18_432MHz_external=External 18.4320 MHz
329.menu.clock.18_432MHz_external.upload.speed=115200
329.menu.clock.18_432MHz_external.bootloader.low_fuses=0xff
329.menu.clock.18_432MHz_external.build.clkpr=
329.menu.clock.18_432MHz_external.build.clock_speed={build.f_cpu}
329.menu.clock.18_432MHz_external.build.f_cpu=18432000L

329.menu.clock.14_7456MHz_external=External 14.7456 MHz
329.menu.clock.14_7456MHz_external.upload.speed=115200
329.menu.clock.14_7456MHz_external.bootloader.low_fuses=0xff
329.menu.clock.14_7456MHz_external.build.clkpr=
329.menu.clock.14_7456MHz_external.build.clock_speed={build.f_cpu}
329.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

329.menu.clock.12MHz_external=External 12 MHz
329.menu.clock.12MHz_external.upload.speed=57600
329.menu.clock.12MHz_external.bootloader.low_fuses=0xff
329.menu.clock.12MHz_external.build.clkpr=
329.menu.clock.12MHz_external.build.clock_speed={build.f_cpu}
329.menu.clock.12MHz_external.build.f_cpu=12000000L

329.menu.clock.11_0592MHz_external=External 11.0592 MHz
329.menu.clock.11_0592MHz_external.upload.speed=115200
329.menu.clock.11_0592MHz_external.bootloader.low_fuses=0xff
329.menu.clock.11_0592MHz_external.build.clkpr=
329.menu.clock.11_0592MHz_external.build.clock_speed={build.f_cpu}
329.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

329.menu.clock.8MHz_external=External 8 MHz
329.menu.clock.8MHz_external.upload.speed=57600
329.menu.clock.8MHz_external.bootloader.low_fuses=0xff
329.menu.clock.8MHz_external.build.clkpr=
329.menu.clock.8MHz_external.build.clock_speed={build.f_cpu}
329.menu.clock.8MHz_external.build.f_cpu=8000000L

329.menu.clock.7_3728MHz_external=External 7.3728 MHz
329.menu.clock.7_3728MHz_external.upload.speed=115200
329.menu.clock.7_3728MHz_external.bootloader.low_fuses=0xff
329.menu.clock.7_3728MHz_external.build.clkpr=
329.menu.clock.7_3728MHz_external.build.clock_speed={build.f_cpu}
329.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

329.menu.clock.4MHz_external=External 4 MHz
329.menu.clock.4MHz_external.upload.speed=9600
329.menu.clock.4MHz_external.bootloader.low_fuses=0xff
329.menu.clock.4MHz_external.build.clkpr=
329.menu.clock.4MHz_external.build.clock_speed={build.f_cpu}
329.menu.clock.4MHz_external.build.f_cpu=4000000L

329.menu.clock.3_6864MHz_external=External 3.6864 MHz
329.menu.clock.3_6864MHz_external.upload.speed=115200
329.menu.clock.3_6864MHz_external.bootloader.low_fuses=0xff
329.menu.clock.3_6864MHz_external.build.clkpr=
329.menu.clock.3_6864MHz_external.build.clock_speed={build.f_cpu}
329.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

329.menu.clock.2MHz_external=External 2 MHz
329.menu.clock.2MHz_external.upload.speed=9600
329.menu.clock.2MHz_external.bootloader.low_fuses=0xff
329.menu.clock.2MHz_external.build.clkpr=
329.menu.clock.2MHz_external.build.clock_speed={build.f_cpu}
329.menu.clock.2MHz_external.build.f_cpu=2000000L

329.menu.clock.1_8432MHz_external=External 1.8432 MHz
329.menu.clock.1_8432MHz_external.upload.speed=115200
329.menu.clock.1_8432MHz_external.bootloader.low_fuses=0xff
329.menu.clock.1_8432MHz_external.build.clkpr=
329.menu.clock.1_8432MHz_external.build.clock_speed={build.f_cpu}
329.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

329.menu.clock.1MHz_external=External 1 MHz
329.menu.clock.1MHz_external.upload.speed=9600
329.menu.clock.1MHz_external.bootloader.low_fuses=0xff
329.menu.clock.1MHz_external.build.clkpr=
329.menu.clock.1MHz_external.build.clock_speed={build.f_cpu}
329.menu.clock.1MHz_external.build.f_cpu=1000000L

329.menu.clock.8MHz_internal=Internal 8 MHz
329.menu.clock.8MHz_internal.upload.speed=38400
329.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
329.menu.clock.8MHz_internal.build.clkpr=
329.menu.clock.8MHz_internal.build.clock_speed={build.f_cpu}
329.menu.clock.8MHz_internal.build.f_cpu=8000000L

329.menu.clock.4MHz_internal=Internal 4 MHz
329.menu.clock.4MHz_internal.upload.speed=9600
329.menu.clock.4MHz_internal.bootloader.low_fuses=0xe2
329.menu.clock.4MHz_internal.build.clkpr=-DOSC_PRESCALER=0x01
329.menu.clock.4MHz_internal.build.clock_speed=8000000L
329.menu.clock.4MHz_internal.build.f_cpu=4000000L

329.menu.clock.2MHz_internal=Internal 2 MHz
329.menu.clock.2MHz_internal.upload.speed=9600
329.menu.clock.2MHz_internal.bootloader.low_fuses=0xe2
329.menu.clock.2MHz_internal.build.clkpr=-DOSC_PRESCALER=0x02
329.menu.clock.2MHz_internal.build.clock_speed=8000000L
329.menu.clock.2MHz_internal.build.f_cpu=2000000L

329.menu.clock.1MHz_internal=Internal 1 MHz
329.menu.clock.1MHz_internal.upload.speed=9600
329.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
329.menu.clock.1MHz_internal.build.clkpr=
329.menu.clock.1MHz_internal.build.clock_speed={build.f_cpu}
329.menu.clock.1MHz_internal.build.f_cpu=1000000L



#####################
####  ATmega325  ####
#####################

# General
325.name=ATmega325
325.upload.tool=avrdude
325.upload.maximum_data_size=2048
325.bootloader.tool=avrdude
325.bootloader.unlock_bits=0x3f
325.bootloader.lock_bits=0x0f
325.build.core=MCUdude_corefiles
325.build.variant=64-pin-avr
325.build.board=AVR_ATmega325
325.build.bootloader_led=B5
325.build.extra_flags={build.clkpr}

# Upload port select
325.menu.bootloader.uart0=Yes (UART0)
325.menu.bootloader.uart0.upload.maximum_size=32256
325.menu.bootloader.uart0.upload.protocol=arduino
325.menu.bootloader.uart0.upload.port=UART0
325.menu.bootloader.uart0.build.export_merged_output=true
325.menu.bootloader.uart0.bootloader.high_fuses=0b1101{bootloader.eesave_bit}110
325.menu.bootloader.uart0.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.clock_speed}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.clock_speed}_{build.bootloader_led}.hex

325.menu.bootloader.no_bootloader=No bootloader
325.menu.bootloader.no_bootloader.upload.maximum_size=32768
325.menu.bootloader.no_bootloader.build.export_merged_output=false
325.menu.bootloader.no_bootloader.bootloader.high_fuses=0b1101{bootloader.eesave_bit}111
325.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# EEPROM
325.menu.eeprom.keep=EEPROM retained
325.menu.eeprom.keep.bootloader.eesave_bit=0
325.menu.eeprom.erase=EEPROM not retained
325.menu.eeprom.erase.bootloader.eesave_bit=1

