Nocterra-Consulting/MegaCore/avr/boards.txt
169.menu.clock.1MHz_internal=Internal 1 MHz
169.menu.clock.1MHz_internal.upload.speed=9600
169.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
169.menu.clock.1MHz_internal.build.clkpr=
169.menu.clock.1MHz_internal.build.clock_speed={build.f_cpu}
169.menu.clock.1MHz_internal.build.f_cpu=1000000L



#####################
####  ATmega165  ####
#####################

# General
165.name=ATmega165
165.upload.tool=avrdude
165.upload.maximum_data_size=1024
165.bootloader.tool=avrdude
165.bootloader.unlock_bits=0x3f
165.bootloader.lock_bits=0x0f
165.build.core=MCUdude_corefiles
165.build.variant=64-pin-avr
165.build.board=AVR_ATmega165
165.build.bootloader_led=B5
165.build.extra_flags={build.clkpr}

# Upload port select
165.menu.bootloader.uart0=Yes (UART0)
165.menu.bootloader.uart0.upload.maximum_size=15872
165.menu.bootloader.uart0.upload.protocol=arduino
165.menu.bootloader.uart0.upload.port=UART0
165.menu.bootloader.uart0.build.export_merged_output=true
165.menu.bootloader.uart0.bootloader.high_fuses=0b1101{bootloader.eesave_bit}100
165.menu.bootloader.uart0.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.clock_speed}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.clock_speed}_{build.bootloader_led}.hex

165.menu.bootloader.no_bootloader=No bootloader
165.menu.bootloader.no_bootloader.upload.maximum_size=16384
165.menu.bootloader.no_bootloader.build.export_merged_output=false
165.menu.bootloader.no_bootloader.bootloader.high_fuses=0b1101{bootloader.eesave_bit}101
165.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# EEPROM
165.menu.eeprom.keep=EEPROM retained
165.menu.eeprom.keep.bootloader.eesave_bit=0
165.menu.eeprom.erase=EEPROM not retained
165.menu.eeprom.erase.bootloader.eesave_bit=1

# Variants
165.menu.variant.modelP=165P/PA
165.menu.variant.modelP.build.mcu=atmega165p
165.menu.variant.modelA=165/A
165.menu.variant.modelA.build.mcu=atmega165

# Brown out detection
165.menu.BOD.2v7=BOD 2.7V
165.menu.BOD.2v7.bootloader.extended_fuses=0xfb
165.menu.BOD.4v3=BOD 4.3V
165.menu.BOD.4v3.bootloader.extended_fuses=0xf9
165.menu.BOD.1v8=BOD 1.8V
165.menu.BOD.1v8.bootloader.extended_fuses=0xfd
165.menu.BOD.disabled=BOD disabled
165.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
165.menu.LTO.Os=LTO disabled
165.menu.LTO.Os.compiler.c.extra_flags=
165.menu.LTO.Os.compiler.c.elf.extra_flags=
165.menu.LTO.Os.compiler.cpp.extra_flags=
165.menu.LTO.Os.ltoarcmd=avr-ar

165.menu.LTO.Os_flto=LTO enabled
165.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
165.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
165.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
165.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies
165.menu.clock.16MHz_external=External 16 MHz
165.menu.clock.16MHz_external.upload.speed=115200
165.menu.clock.16MHz_external.bootloader.low_fuses=0xff
165.menu.clock.16MHz_external.build.clkpr=
165.menu.clock.16MHz_external.build.clock_speed={build.f_cpu}
165.menu.clock.16MHz_external.build.f_cpu=16000000L

165.menu.clock.20MHz_external=External 20 MHz
165.menu.clock.20MHz_external.upload.speed=115200
165.menu.clock.20MHz_external.bootloader.low_fuses=0xff
165.menu.clock.20MHz_external.build.clkpr=
165.menu.clock.20MHz_external.build.clock_speed={build.f_cpu}
165.menu.clock.20MHz_external.build.f_cpu=20000000L

165.menu.clock.18_432MHz_external=External 18.4320 MHz
165.menu.clock.18_432MHz_external.upload.speed=115200
165.menu.clock.18_432MHz_external.bootloader.low_fuses=0xff
165.menu.clock.18_432MHz_external.build.clkpr=
165.menu.clock.18_432MHz_external.build.clock_speed={build.f_cpu}
165.menu.clock.18_432MHz_external.build.f_cpu=18432000L

165.menu.clock.14_7456MHz_external=External 14.7456 MHz
165.menu.clock.14_7456MHz_external.upload.speed=115200
165.menu.clock.14_7456MHz_external.bootloader.low_fuses=0xff
165.menu.clock.14_7456MHz_external.build.clkpr=
165.menu.clock.14_7456MHz_external.build.clock_speed={build.f_cpu}
165.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

165.menu.clock.12MHz_external=External 12 MHz
165.menu.clock.12MHz_external.upload.speed=57600
165.menu.clock.12MHz_external.bootloader.low_fuses=0xff
165.menu.clock.12MHz_external.build.clkpr=
165.menu.clock.12MHz_external.build.clock_speed={build.f_cpu}
165.menu.clock.12MHz_external.build.f_cpu=12000000L

165.menu.clock.11_0592MHz_external=External 11.0592 MHz
165.menu.clock.11_0592MHz_external.upload.speed=115200
165.menu.clock.11_0592MHz_external.bootloader.low_fuses=0xff
165.menu.clock.11_0592MHz_external.build.clkpr=
165.menu.clock.11_0592MHz_external.build.clock_speed={build.f_cpu}
165.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

165.menu.clock.8MHz_external=External 8 MHz
165.menu.clock.8MHz_external.upload.speed=57600
165.menu.clock.8MHz_external.bootloader.low_fuses=0xff
165.menu.clock.8MHz_external.build.clkpr=
165.menu.clock.8MHz_external.build.clock_speed={build.f_cpu}
165.menu.clock.8MHz_external.build.f_cpu=8000000L

165.menu.clock.7_3728MHz_external=External 7.3728 MHz
165.menu.clock.7_3728MHz_external.upload.speed=115200
165.menu.clock.7_3728MHz_external.bootloader.low_fuses=0xff
165.menu.clock.7_3728MHz_external.build.clkpr=
165.menu.clock.7_3728MHz_external.build.clock_speed={build.f_cpu}
165.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

165.menu.clock.4MHz_external=External 4 MHz
165.menu.clock.4MHz_external.upload.speed=9600
165.menu.clock.4MHz_external.bootloader.low_fuses=0xff
165.menu.clock.4MHz_external.build.clkpr=
165.menu.clock.4MHz_external.build.clock_speed={build.f_cpu}
165.menu.clock.4MHz_external.build.f_cpu=4000000L

165.menu.clock.3_6864MHz_external=External 3.6864 MHz
165.menu.clock.3_6864MHz_external.upload.speed=115200
165.menu.clock.3_6864MHz_external.bootloader.low_fuses=0xff
165.menu.clock.3_6864MHz_external.build.clkpr=
165.menu.clock.3_6864MHz_external.build.clock_speed={build.f_cpu}
165.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

165.menu.clock.2MHz_external=External 2 MHz
165.menu.clock.2MHz_external.upload.speed=9600
165.menu.clock.2MHz_external.bootloader.low_fuses=0xff
165.menu.clock.2MHz_external.build.clkpr=
165.menu.clock.2MHz_external.build.clock_speed={build.f_cpu}
165.menu.clock.2MHz_external.build.f_cpu=2000000L

165.menu.clock.1_8432MHz_external=External 1.8432 MHz
165.menu.clock.1_8432MHz_external.upload.speed=115200
165.menu.clock.1_8432MHz_external.bootloader.low_fuses=0xff
165.menu.clock.1_8432MHz_external.build.clkpr=
165.menu.clock.1_8432MHz_external.build.clock_speed={build.f_cpu}
165.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

