Nocterra-Consulting/MegaCore/avr/boards.txt
64.menu.clock.14_7456MHz_external=External 14.7456 MHz
64.menu.clock.14_7456MHz_external.upload.speed=115200
64.menu.clock.14_7456MHz_external.bootloader.sut_cksel_bits=111111
64.menu.clock.14_7456MHz_external.bootloader.ckopt_bit=0
64.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

64.menu.clock.12MHz_external=External 12 MHz
64.menu.clock.12MHz_external.upload.speed=57600
64.menu.clock.12MHz_external.bootloader.sut_cksel_bits=111111
64.menu.clock.12MHz_external.bootloader.ckopt_bit=0
64.menu.clock.12MHz_external.build.f_cpu=12000000L

64.menu.clock.11_0592MHz_external=External 11.0592 MHz
64.menu.clock.11_0592MHz_external.upload.speed=115200
64.menu.clock.11_0592MHz_external.bootloader.sut_cksel_bits=111111
64.menu.clock.11_0592MHz_external.bootloader.ckopt_bit=0
64.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

64.menu.clock.8MHz_external=External 8 MHz
64.menu.clock.8MHz_external.upload.speed=38400
64.menu.clock.8MHz_external.bootloader.sut_cksel_bits=111111
64.menu.clock.8MHz_external.bootloader.ckopt_bit=0
64.menu.clock.8MHz_external.build.f_cpu=8000000L

64.menu.clock.7_3728MHz_external=External 7.3728 MHz
64.menu.clock.7_3728MHz_external.upload.speed=115200
64.menu.clock.7_3728MHz_external.bootloader.sut_cksel_bits=111111
64.menu.clock.7_3728MHz_external.bootloader.ckopt_bit=0
64.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

64.menu.clock.4MHz_external=External 4 MHz
64.menu.clock.4MHz_external.upload.speed=9600
64.menu.clock.4MHz_external.bootloader.sut_cksel_bits=111111
64.menu.clock.4MHz_external.bootloader.ckopt_bit=0
64.menu.clock.4MHz_external.build.f_cpu=4000000L

64.menu.clock.3_6864MHz_external=External 3.6864 MHz
64.menu.clock.3_6864MHz_external.upload.speed=115200
64.menu.clock.3_6864MHz_external.bootloader.sut_cksel_bits=111111
64.menu.clock.3_6864MHz_external.bootloader.ckopt_bit=0
64.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

64.menu.clock.2MHz_external=External 2 MHz
64.menu.clock.2MHz_external.upload.speed=9600
64.menu.clock.2MHz_external.bootloader.sut_cksel_bits=111111
64.menu.clock.2MHz_external.bootloader.ckopt_bit=0
64.menu.clock.2MHz_external.build.f_cpu=2000000L

64.menu.clock.1_8432MHz_external=External 1.8432 MHz
64.menu.clock.1_8432MHz_external.upload.speed=115200
64.menu.clock.1_8432MHz_external.bootloader.sut_cksel_bits=111111
64.menu.clock.1_8432MHz_external.bootloader.ckopt_bit=0
64.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

64.menu.clock.1MHz_external=External 1 MHz
64.menu.clock.1MHz_external.upload.speed=9600
64.menu.clock.1MHz_external.bootloader.sut_cksel_bits=111111
64.menu.clock.1MHz_external.bootloader.ckopt_bit=0
64.menu.clock.1MHz_external.build.f_cpu=1000000L

64.menu.clock.8MHz_internal=Internal 8 MHz
64.menu.clock.8MHz_internal.upload.speed=38400
64.menu.clock.8MHz_internal.bootloader.sut_cksel_bits=100100
64.menu.clock.8MHz_internal.bootloader.ckopt_bit=1
64.menu.clock.8MHz_internal.build.f_cpu=8000000L

64.menu.clock.1MHz_internal=Internal 1 MHz
64.menu.clock.1MHz_internal.upload.speed=9600
64.menu.clock.1MHz_internal.bootloader.sut_cksel_bits=100001
64.menu.clock.1MHz_internal.bootloader.ckopt_bit=1
64.menu.clock.1MHz_internal.build.f_cpu=1000000L



#####################
#### AT90CAN128  ####
#####################

# General
can128.name=AT90CAN128
can128.upload.tool=avrdude
can128.upload.maximum_data_size=4096
can128.bootloader.tool=avrdude
can128.bootloader.unlock_bits=0x3f
can128.bootloader.lock_bits=0x0f
can128.build.core=MCUdude_corefiles
can128.build.variant=64-pin-avr
can128.build.board=AVR_AT90CAN128
can128.build.mcu=at90can128
can128.build.bootloader_led=B5
can128.build.extra_flags={build.clkpr}

# Upload port select
can128.menu.bootloader.uart0=Yes (UART0)
can128.menu.bootloader.uart0.upload.maximum_size=130048
can128.menu.bootloader.uart0.upload.protocol=arduino
can128.menu.bootloader.uart0.upload.port=UART0
can128.menu.bootloader.uart0.build.export_merged_output=true
can128.menu.bootloader.uart0.bootloader.high_fuses=0b1101{bootloader.eesave_bit}110
can128.menu.bootloader.uart0.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.clock_speed}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.clock_speed}_{build.bootloader_led}_BIGBOOT.hex

can128.menu.bootloader.uart1=Yes (UART1)
can128.menu.bootloader.uart1.upload.maximum_size=130048
can128.menu.bootloader.uart1.upload.protocol=arduino
can128.menu.bootloader.uart1.upload.port=UART1
can128.menu.bootloader.uart1.build.export_merged_output=true
can128.menu.bootloader.uart1.bootloader.high_fuses=0b1101{bootloader.eesave_bit}110
can128.menu.bootloader.uart1.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.clock_speed}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.clock_speed}_{build.bootloader_led}_BIGBOOT.hex

can128.menu.bootloader.no_bootloader=No bootloader
can128.menu.bootloader.no_bootloader.upload.maximum_size=131072
can128.menu.bootloader.no_bootloader.build.export_merged_output=false
can128.menu.bootloader.no_bootloader.bootloader.high_fuses=0b1101{bootloader.eesave_bit}111
can128.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# EEPROM
can128.menu.eeprom.keep=EEPROM retained
can128.menu.eeprom.keep.bootloader.eesave_bit=0
can128.menu.eeprom.erase=EEPROM not retained
can128.menu.eeprom.erase.bootloader.eesave_bit=1

# Brown out detection
can128.menu.BOD.2v7=BOD 2.7V
can128.menu.BOD.2v7.bootloader.extended_fuses=0xf5
can128.menu.BOD.4v1=BOD 4.1V
can128.menu.BOD.4v1.bootloader.extended_fuses=0xfd
can128.menu.BOD.4v0=BOD 4.0V
can128.menu.BOD.4v0.bootloader.extended_fuses=0xfb
can128.menu.BOD.3v9=BOD 3.9V
can128.menu.BOD.3v9.bootloader.extended_fuses=0xf9
can128.menu.BOD.3v8=BOD 3.8V
can128.menu.BOD.3v8.bootloader.extended_fuses=0xf7
can128.menu.BOD.2v6=BOD 2.6V
can128.menu.BOD.2v6.bootloader.extended_fuses=0xf3
can128.menu.BOD.2v5=BOD 2.5V
can128.menu.BOD.2v5.bootloader.extended_fuses=0xf1
can128.menu.BOD.disabled=BOD disabled
can128.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
can128.menu.LTO.Os=LTO disabled
can128.menu.LTO.Os.compiler.c.extra_flags=
can128.menu.LTO.Os.compiler.c.elf.extra_flags=
can128.menu.LTO.Os.compiler.cpp.extra_flags=
can128.menu.LTO.Os.ltoarcmd=avr-ar

